class FunctionConfig {
  ///快捷修改
  static const List quickData = [
    '渣机画质',
    '流畅画质',
    'HDR高清画质',
    '超高清画质',
    '8P原生画质',
    '大主播同款',
  ];

  ///性能优化
  static const List powerData = [
    {
      'title': '修复闪退',
      'subtitle': '修复部分机型修改闪退问题',
      'content': '如部分华为、OPPO、VIVO等机型修改后出现游戏闪退，可通过修复解决！'
    },
    {
      'title': 'SV优化',
      'subtitle': '通过优化尽可能减少发热与掉帧',
      'content': '是否注入SV优化，将会减少发热与掉帧，并锁定后台所运行的程序将游戏放入优先级，把流畅度优化到极致！'
    },
    {
      'title': 'CPU超频',
      'subtitle': '旧骁龙处理器超频优化的App',
      'content':
          '这是一款支持高通骁龙处理器大核小核的调节软件，可调满血或者锁定频率，无需手机Root权限。软件需要开启后台服务才会一直有效，超频后需将应用放入白名单防止杀后台！'
    }
  ];

  ///其他功能
  static const List otherData = [
    '解锁画质+120帧（EC）',
    '解锁超高音质',
    '1000陀螺仪灵敏度',
  ];

  ///重置功能
  static const List restoreData = [
    {'title': '重置画质', 'subtitle': '重置画质为初始值'},
    {'title': '重置音质', 'subtitle': '重置音质为初始值'},
    {'title': '重置所有功能', 'subtitle': '重新初始化所有功能'}
  ];

  ///多样化修改
  static const List diversifyData = [
    {'title': '专属修改', 'subtitle': '更加多样化的画质修改'},
    {'title': '高优化修改', 'subtitle': '更多精心优化的画质修改'},
  ];

  ///机型修改
  static const List modelData = [
    {'title': '低端机', 'subtitle': '专门针对低端机的画质修改'},
    {'title': '中端机', 'subtitle': '专门针对中端机的画质修改'},
    {'title': '高端机', 'subtitle': '专门针对高端机的画质修改'},
  ];

  ///更多功能
  static const List moreData = [
    {'title': '机型画质模拟', 'subtitle': '根据设备参数一比一模拟原生画质'},
    {'title': '超广角专区', 'subtitle': '拥有平板比例、超视角游戏等'},
    {'title': '随机修改', 'subtitle': '选择困难症？试试这个吧！'},
  ];

  ///专属修改
  static const List exclusive = [
    '高优化/低纹理/高地面材质',
    '1.25分辨率/中纹理/中清晰度/中阴影',
    '120帧数/2K分辨率',
    '通用画质/流畅/极限/高优化',
    '高清/4倍抗锯齿/中纹理',
    '均衡/2倍分辨率/低纹理',
    '高优化/HDR高清/高纹理',
    '骁龙优化/HDR高清/高纹理/高阴影',
    'HDR高清/4倍抗锯齿/高纹理',
    '联发科优化/均衡/4倍抗锯齿/极限',
    '高清/4倍抗锯齿/高纹理/高阴影',
    '高清/中阴影/中纹理'
  ];

  ///高优化修改
  static const List highOptimize = [
    '流畅/极限/鲜艳',
    '高优化/流畅/钢枪专用',
    '高优化/低端机/流畅/极限',
    'HDR高清/2K画质/看风景',
    '高清/高纹理/中反光',
    'HDR高清/中端机优化/极限',
    'HDR高清/中纹理/中反光',
    '中端机优化/中抗锯齿/极限',
    'HDR高清/全超高/火力全开',
    '联发科优化/HDR高清/钢枪/极限',
    '流畅/高纹理/高反光/4倍抗锯齿',
    '高端机优化/HDR高清/钢枪/极限'
  ];

  ///低端机
  static const List lowModel = [
    '低端机钢枪不卡',
    '渣机极限帧画质',
    '流畅钢枪',
    '低端机画质',
    '无任何特效远视距',
    '流畅鲜艳看人清楚',
    '流畅画质全部最低',
    '丝滑无比柔和画质流畅',
    '流畅渣机画质',
    '钢枪不卡落地不卡',
    '钢枪不卡画质',
    '鲜艳流畅钢枪'
  ];

  ///中端机
  static const List mediumModel = [
    '稳定帧率画质',
    '1K分辨率超远视距HDR渲染',
    '高清画质',
    '流畅60帧无阴影',
    '特效不错全程看风景渣机勿扰',
    '流畅钢枪',
    '高清画质钢枪',
    '看人清晰钢枪不卡',
    '写实流畅钢枪',
    '钢枪不卡不发热',
    '极限帧不掉帧',
  ];

  ///高端机
  static const List highModel = [
    '超强粒子特效鲜艳强大画质顶级',
    '特效基本全开反光阴影HDR电影',
    'HDR高清高纹理高阴影高反光',
    '高反光高远视2K分辨率超高清',
    '超高清顶级画质渣机勿扰',
    '超高清画质4K分辨率',
    '远处看人清楚特效全开',
    '超级流畅画质纵享丝滑',
    '特效全部最高渣机勿扰',
    '超高清电影画质'
  ];

  ///超广角
  static const List wideAngle = [
    '《和平精英》平板超广角无黑边+120帧率🔥',
    '《和平精英》手机16：9专用超广角+120帧率🚀',
    '《和平精英》渣机超广角🔴（低分辨率+120帧率）',
    '《和平精英》渣机平板超广角+120帧率⭐',
    '《和平精英》超级广角视野💥（腰射优势）',
    '《和平精英》平板低超广角+120帧率（防闪退）🤖',
    '《PUBG国际服》手机16：9专用超广角+120帧率🚀',
    '《PUBG国际服》渣机超广角🔴（低分辨率+120帧率）'
  ];
}
